[
  {
    "image": "https://i.ibb.co.com/Y4dw8KpS/Spotify-removebg-preview.png",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Spotify stands as the undisputed global leader in digital music and podcast streaming. It offers users instant access to a massive library featuring millions of tracks from every genre, alongside a growing collection of exclusive podcasts. The core strength of the Spotify experience lies in its sophisticated, AI-driven recommendation engine, which learns user preferences over time to suggest new artists, personalized playlists (like Discover Weekly), and daily mixes, ensuring music discovery never stops. Beyond individual listening, the platform fosters social connection, allowing users to share their favorite tracks and collaborate on playlists with friends. Spotify is available across a multitude of devices, including smartphones, tablets, desktop computers, and smart speakers, providing a seamless listening experience whether you're at home, commuting, or at the gym. Its interface is intuitively designed, prioritizing ease of navigation and a clean aesthetic. The service operates on a freemium model; the free tier includes ad-supported listening with limitations on skips, while the premium subscription unlocks ad-free playback, unlimited skips, high-quality audio, and the ability to download music for offline listening. The introduction of exclusive content and video elements further solidifies Spotify's position not just as a music player, but as a comprehensive audio entertainment hub that continually adapts to the evolving digital landscape. It is the essential app for anyone looking to curate their own soundtrack to life, offering both nostalgic hits and the freshest releases instantly. The platform's commitment to supporting both major and independent artists makes it a vital part of the modern music ecosystem, bridging creators and listeners across every corner of the globe.",
    "size": 45,
    "reviews": 85,
    "ratingAvg": 4.4,
    "downloads": 35,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 2400000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qL7SmZ1B/Instagram.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram, developed by Meta Platforms, Inc., has evolved far beyond its original function as a simple photo-sharing application to become a multifaceted platform central to modern social life and digital commerce. It serves as a visual diary for billions, enabling users to share photos and videos through their feed, the ephemeral **Stories** feature, and the highly engaging **Reels** short-video format. The app is a dominant force in influencer marketing, giving brands and creators a powerful channel to connect with vast, targeted audiences. The Explore page utilizes complex algorithms to introduce users to new content, accounts, and trends based on their interaction history, making content discovery effortless and highly personalized. Direct messaging capabilities facilitate private communication, while features like **Live Video** and **IGTV** (now integrated into the main video features) allow for real-time interaction and longer-form content. Instagram’s **Shopping** tab seamlessly integrates e-commerce, allowing users to discover and purchase products directly from photos and videos without leaving the application. This blend of social connection, visual storytelling, and retail has solidified its role as a cultural barometer. For many, it acts as a primary news source, a fashion magazine, and a portfolio. The platform continually balances its commitment to fostering authentic connection with its drive to introduce new, competitive features, most notably the short-form, viral video format popularized by Reels, ensuring it remains at the forefront of the social media space. Its global reach makes it an essential tool for personal branding and business growth in the digital age.",
    "size": 55,
    "reviews": 160,
    "ratingAvg": 4.1,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 3500000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 125000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0jRRrwDT/Telegram-removebg-preview.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 3,
    "description": "Telegram is a versatile, cloud-based messaging platform renowned for its speed, security, and powerful set of features that extend far beyond simple one-on-one chats. Its core selling point is **cloud-based synchronization**, allowing users to access their messages, photos, and files from multiple devices simultaneously, including a robust desktop application, without needing their phone nearby. Telegram offers two distinct levels of privacy: standard chats are encrypted between the client and the server, and highly secure **Secret Chats** utilize end-to-end encryption, ensuring only the sender and recipient can read the messages. The platform is especially favored for its community features. Users can create **Groups** supporting up to 200,000 members and **Channels** for broadcasting messages to unlimited audiences, making it a powerful tool for news dissemination, community management, and professional communication. File sharing is remarkably generous, allowing users to send files up to 2 GB in size. Other unique features include customizable themes, animated stickers, and a rich ecosystem of third-party **Bots** that can automate tasks, integrate external services, and even host mini-games directly within the chat interface. Telegram’s commitment to providing a feature-rich, open-source client experience and its strong focus on user privacy and security make it a preferred alternative to many mainstream communication apps, particularly for users who require high capacity and advanced community tools. The app’s continuous innovation ensures it remains a powerful, forward-thinking player in the competitive messaging space.",
    "size": 35,
    "reviews": 120,
    "ratingAvg": 4.5,
    "downloads": 40,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wNwdJqP4/Gmail.png",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 4,
    "description": "The Gmail app, developed by Google LLC, is the mobile interface for the world’s most popular free email service, offering a fast, secure, and highly organized way to manage digital correspondence on the go. Its primary function is providing seamless access to email, prioritizing a **clean, ad-minimal interface** and a powerful search engine inherited from Google’s core technology. The app excels in **inbox categorization**, automatically sorting incoming mail into primary, social, and promotions tabs, drastically reducing clutter and helping users focus on important messages. Security is a key feature, with Google implementing robust measures like **machine learning-based spam filtering** and **Phishing** protection to keep inboxes safe. Furthermore, the integration with the broader Google ecosystem is seamless: users can easily attach files directly from Google Drive or quickly join a Google Meet call directly from an email invitation. **Smart Compose** and **Smart Reply** features utilize AI to suggest phrases and quick responses, dramatically accelerating email composition. The app supports multiple accounts, allowing users to switch easily between personal, work, and secondary addresses. Its offline capabilities ensure users can read, compose, and organize emails even without an internet connection, with actions syncing automatically once connectivity is restored. This combination of intelligent organization, strong security, and deep integration with other productivity tools establishes Gmail as the gold standard for mobile email management, catering to both the casual user and the demanding professional alike.",
    "size": 40,
    "reviews": 250,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 74000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/S7G1QhTT/Whatsapp.jpg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 5,
    "description": "WhatsApp, a Meta Platforms, Inc. product, is a widely adopted, cross-platform messaging and VoIP service that has become synonymous with secure, private, and free communication across the globe. The app's foundation rests on **end-to-end encryption** (E2EE), powered by the Signal Protocol, ensuring that all messages, calls, photos, and video shared are secured from third-party interception, including from WhatsApp itself. This commitment to privacy is a major factor in its immense global popularity. Beyond text messaging, WhatsApp supports high-quality **voice and video calls**, allowing users to connect instantly with individuals or groups internationally without incurring traditional telecommunications charges, requiring only an internet connection. Key features include the creation of large **Group Chats** for family, friends, or work teams, the ability to share a variety of file types (documents, photos, contacts, and location), and the **Status** feature, which allows users to post time-limited photo and video updates. The introduction of **WhatsApp Business** caters to small and large enterprises, offering tools for automated messaging, quick replies, and product catalog displays, blurring the line between personal and professional communication. Its simplicity, reliability, and ubiquity, particularly in developing nations, make it a crucial tool for both daily personal correspondence and vital business operations. WhatsApp's continuous focus on maintaining a clean, ad-free experience, combined with its strong security model, solidifies its status as the default messaging app for billions worldwide.",
    "size": 38,
    "reviews": 178,
    "ratingAvg": 4.6,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 152000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8nr0JkB7/chatgpt.png",
    "title": "ChatGPT",
    "companyName": "OpenAI",
    "id": 6,
    "description": "ChatGPT, an advanced AI chatbot developed by **OpenAI**, represents a significant leap in conversational artificial intelligence, built upon the powerful **GPT-5** (or subsequent large language models) architecture. Its primary function is to facilitate natural and fluent human-like conversation, allowing users to engage with it on virtually any topic. The application excels at generating detailed, coherent, and contextually relevant text, making it an invaluable assistant for a wide range of tasks. Users can leverage ChatGPT to **draft emails, write complex code snippets, compose creative stories, summarize lengthy documents, or even practice a new language**. The utility's core strength lies in its ability to understand complex prompts, maintain conversational context across multiple turns, and provide accurate, creatively diverse, and helpful responses. Its versatility positions it as a revolutionary tool in both professional and educational settings, allowing students to clarify concepts and professionals to automate repetitive writing tasks. Crucially, the app acts as a vast knowledge base, providing explanations and information far faster than traditional searching, transforming the way people seek and process information. As a leading example of generative AI, ChatGPT continually evolves, offering increasingly personalized and nuanced interactions, pushing the boundaries of what is possible with artificial intelligence in everyday applications and solving problems through intuitive dialogue.",
    "size": 55,
    "reviews": 42,
    "ratingAvg": 4.6,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2650000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Df70QmyJ/Netflex-removebg-preview.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "Netflix is the dominant global subscription video-on-demand (SVOD) service, offering a vast library of movies, TV shows, documentaries, and its critically acclaimed **Netflix Originals**. The app provides subscribers with unlimited, ad-free streaming access, fundamentally changing how consumers view and access entertainment. Central to the Netflix experience is its highly refined recommendation system, which analyzes viewing habits, ratings, and search history to provide personalized suggestions, ensuring users spend less time searching and more time watching. The app's interface is designed for easy browsing, with intuitive categories and personalized rows that highlight relevant content. Key features include the ability to **download titles for offline viewing**, perfect for travel or areas with poor internet connectivity, and the creation of multiple user profiles under a single subscription, allowing family members to maintain separate viewing histories and preferences. Netflix has heavily invested in producing its own original content, ranging from hit series to blockbuster films, which serves as a major draw and differentiator in the crowded streaming market. The app supports streaming across almost every platform imaginable, including smartphones, smart TVs, gaming consoles, and desktop browsers, guaranteeing accessibility and convenience. Its high-quality streaming capabilities, often supporting 4K and HDR content, ensure a premium viewing experience, cementing Netflix's status as an entertainment powerhouse.",
    "size": 80,
    "reviews": 25,
    "ratingAvg": 4.3,
    "downloads": 30,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 14000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/VcHzxTDX/Youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 8,
    "description": "YouTube, owned by Google LLC, is the world's largest online video sharing platform and the second most visited website globally. It functions as an unparalleled repository of content, hosting everything from professional music videos, educational tutorials, and news broadcasts to user-generated vlogs and entertainment. The app is characterized by its powerful **search functionality** and a highly addictive recommendation algorithm that drives user engagement by suggesting personalized videos. YouTube's success is built upon its global community of **creators**, who upload millions of hours of new video content daily, democratizing video production and distribution. Key features for users include subscription management, allowing fans to follow their favorite channels; playlists for organizing content; and high-quality streaming, often supporting 4K resolution. The platform offers monetization tools for creators and provides the **YouTube Premium** subscription service, which offers an ad-free experience, background playback, and access to YouTube Music. For content creators, YouTube Studio provides detailed analytics, video management tools, and live-streaming capabilities. As a hub for both passive consumption and active learning, YouTube transcends simple entertainment, serving as a vast educational resource and a vital platform for political and social discourse, defining the standard for digital video consumption globally and continuously adapting to new formats like Shorts.",
    "size": 40,
    "reviews": 158,
    "ratingAvg": 4.5,
    "downloads": 400,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 130000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/j9G03bVt/Facebook.jpg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 9,
    "description": "Facebook, the flagship social networking service from Meta Platforms, Inc., remains one of the most comprehensive digital platforms for connection, sharing, and interaction globally. Its primary function is to help users maintain personal relationships by sharing life updates, photos, videos, and thoughts through a personalized **News Feed**. Beyond individual profiles, Facebook is instrumental in fostering **community and group engagement**, allowing users to join groups based on shared interests, hobbies, or local areas, creating deep social bonds. Features like **Marketplace** facilitate local buying and selling, while the integration of **Messenger** allows for instant private and group communication. The platform is also crucial for **businesses and organizations**, providing pages, advertising tools, and analytics to connect with their customer base and share official information. The development of **Facebook Live** allows for real-time video broadcasting, enabling events, Q&A sessions, and news delivery. Despite the rise of newer social apps, Facebook's vast user base and its established ecosystem of features—including its memory feature for nostalgic look-backs, event planning tools, and detailed privacy controls—ensure its continuing relevance. It serves as a digital identity for billions, offering a blend of personal connection, professional networking, and content consumption, continually adapting its algorithms to keep the user experience fresh and engaging in a competitive digital environment.",
    "size": 60,
    "reviews": 385,
    "ratingAvg": 4.1,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 146000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nN9ZfG87/Twitter.jpg",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 10,
    "description": "Twitter, now rebranded as X and owned by X Corp., is a unique microblogging and social networking service known for its **real-time information flow** and its role in shaping global public discourse. The platform's core revolves around short, frequent posts—originally limited to 140 characters, now significantly expanded—which facilitate quick dissemination of news, opinions, and reactions. Its strength lies in its ability to quickly report **trending discussions and breaking news**, often ahead of traditional media outlets, making it an indispensable tool for journalists, politicians, and engaged citizens. Key features include the **Retweet** function for rapid content sharing, the use of **hashtags (#)** for categorization and topic tracking, and the 'For You' and 'Following' feeds that organize content based on algorithmic recommendations and direct follows, respectively. X fosters a sense of immediacy and global connection, allowing users to engage in public conversations with influential figures worldwide. The platform has increasingly focused on video content and has introduced features for longer-form writing and content monetization for premium users. Despite its changes, X maintains its function as a vital, high-velocity public square where diverse viewpoints, political commentary, and cultural moments collide in real-time, making it an essential digital utility for staying informed and participating in the immediate global conversation.",
    "size": 40,
    "reviews": 12,
    "ratingAvg": 4.0,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 3500000 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fgJJbmZ/Canva.png",
    "title": "Canva",
    "companyName": "Canva",
    "id": 11,
    "description": "Canva is a revolutionary graphic design platform that has democratized visual creation, making it accessible to professionals and amateurs alike without needing specialized software knowledge. The app provides a user-friendly, drag-and-drop interface complemented by an extensive library of professional **templates** for virtually any need: social media posts, presentations, posters, invitations, and resumes. Its power lies in simplifying complex design principles, offering pre-made layouts, font pairings, and color palettes that ensure high-quality, aesthetically pleasing results. Core features include a massive collection of stock photos, illustrations, icons, and fonts, all easily searchable and customizable. Canva supports **team collaboration**, allowing multiple users to work on a single design in real-time, making it invaluable for small businesses and marketing teams. The app extends beyond static images to offer **video editing** capabilities and tools for creating animated graphics. Its mobile version ensures users can create and edit designs anywhere, maintaining productivity on the go. By removing the steep learning curve associated with traditional graphic design software, Canva empowers millions to translate their ideas into stunning visuals quickly and efficiently, cementing its status as the go-to platform for all non-professional and many professional design needs in the digital age.",
    "size": 75,
    "reviews": 25,
    "ratingAvg": 4.8,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 12380000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qY5rLjQ8/CapCut.png",
    "title": "CapCut",
    "companyName": "Bytedance Pte. Ltd.",
    "id": 12,
    "description": "CapCut, developed by Bytedance Pte. Ltd., is a leading, all-in-one free video editing application that has achieved massive popularity, particularly among **creators and influencers** focused on short-form content platforms like TikTok and Instagram Reels. Its success stems from offering a powerful suite of professional-grade editing tools within an incredibly **user-friendly and intuitive mobile interface**. The app provides essential features like cutting, trimming, and speed control, alongside advanced capabilities such as **keyframe animation**, **Chroma key** (green screen), video stabilization, and high-quality filters and effects. CapCut is renowned for its vast library of royalty-free music and sound effects, making it simple to add high-production value audio to videos. A key attraction is its constantly updated selection of viral **templates** and trending effects, enabling users to effortlessly replicate popular social media styles. The app's ability to export videos in high definition without watermarks (or with an easily removable one) makes it the default tool for millions of mobile video editors. CapCut democratizes complex video production, allowing anyone with a smartphone to create polished, professional-looking video content quickly and efficiently, defining the standard for mobile video creativity in the digital content creation landscape.",
    "size": 80,
    "reviews": 20,
    "ratingAvg": 4.6,
    "downloads": 25,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WvPx6L3L/Pinterest.jpg",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 13,
    "description": "Pinterest functions as a unique **visual discovery engine** where users can find and save creative ideas for every possible interest, hobby, and project, from home décor and fashion to recipes and travel planning. It operates on the concept of 'Pinning,' where users save images, known as **Pins**, onto customized boards, essentially curating personalized digital mood boards and collections. Unlike traditional social media, Pinterest is centered on **inspiration and action**, guiding users from the initial idea to the execution phase. The platform's search functionality is visually driven, allowing users to search by image or using specific keywords to find relevant content, often leading to products, blog posts, or tutorials. Key features include **Lens**, a tool that uses a phone's camera to identify objects and find related Pins, and **Idea Pins**, a multi-page video format for step-by-step tutorials and storytelling. For businesses, Pinterest serves as a powerful e-commerce tool, driving traffic and sales by showcasing products in an inspirational context. Its non-linear, discovery-oriented interface makes it an ideal platform for planning events, gathering resources, or simply browsing for aesthetic pleasure, acting as a personal digital scrapbook and an engine for turning dreams into reality.",
    "size": 35,
    "reviews": 12,
    "ratingAvg": 4.7,
    "downloads": 15,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 8700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Rp6BdStx/Amazon.webp",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 14,
    "description": "The Amazon Shopping app, developed by Amazon Mobile LLC, brings the vast selection and convenience of the world's largest online retailer directly to the user's mobile device. This application is essential for browsing, searching, and purchasing millions of products across virtually every category imaginable, from electronics and books to groceries and apparel. Its primary strength lies in its **robust search and filtering capabilities**, allowing users to quickly locate specific items, read detailed customer reviews, and compare prices. Key features include personalized recommendations based on past purchases and browsing history, **voice search** for hands-free shopping, and the ability to scan barcodes to find products instantly. Crucially, the app provides real-time **order tracking and notifications**, keeping users informed from purchase to delivery. Integrated security features ensure secure payment processing, and easy access to customer service makes resolving issues straightforward. For **Prime members**, the app provides seamless access to exclusive deals, fast shipping options, and integrated streaming access. The Amazon Shopping app transforms the complex experience of large-scale retail into a simple, convenient, and secure mobile activity, defining the standard for modern e-commerce convenience and accessibility.",
    "size": 60,
    "reviews": 20,
    "ratingAvg": 4.5,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 1500000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xS4nxrTB/Goggle-Maps.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 15,
    "description": "Google Maps, a pivotal service from Google LLC, is the world’s leading digital mapping and navigation application, serving as an indispensable tool for traveling, exploring, and commuting. The app provides comprehensive, high-definition satellite and street-level imagery, combined with an industry-leading navigation system. Its key feature is **real-time turn-by-turn navigation** for driving, walking, cycling, and public transit, constantly updating routes based on live traffic conditions to minimize delays. The app excels in **local exploration**, allowing users to search for businesses, restaurants, landmarks, and gas stations, complete with operating hours, contact information, and crowd-sourced reviews and photos. **Live View** uses augmented reality (AR) to overlay directions onto the real world via the phone's camera, enhancing pedestrian navigation. Critical utilities include the ability to **download maps for offline use**, ensuring navigation even without cellular data, and integration with user history to provide personalized recommendations. Google Maps is continuously updated with community contributions, providing rich, up-to-the-minute details on accessibility, popularity, and localized information, fundamentally transforming how people interact with the physical world and ensuring smooth, efficient movement in both familiar and new environments.",
    "size": 45,
    "reviews": 95,
    "ratingAvg": 4.6,
    "downloads": 150,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 3500000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 65500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Cp89ps2g/DuoLingo.png",
    "title": "Duolingo",
    "companyName": "Duolingo",
    "id": 16,
    "description": "Duolingo is the world's most popular language learning application, distinguished by its gamified approach that makes learning new languages fun, engaging, and highly accessible. The platform offers courses in dozens of languages, utilizing bite-sized, interactive lessons designed to build proficiency through repetition, quizzes, and achievement tracking. The core methodology centers on a **skill tree progression**, rewarding users with virtual currency and experience points (XP) for completing lessons, mirroring the addictive structure of mobile games. This gamification is highly effective at maintaining user motivation and consistency, crucial factors in successful language acquisition. Key features include personalized learning paths based on user performance, regular review sessions, and engaging characters (Duolingo's mascot, Duo) that encourage daily practice. The app emphasizes practical reading, writing, listening, and speaking skills through varied exercise types. While the basic version is free and ad-supported, a **Super Duolingo** subscription removes ads, provides unlimited 'hearts' (lives), and offers practice hub features. Duolingo successfully transforms the daunting task of learning a new language into a simple, habit-forming daily activity, leveraging technology to make educational content globally scalable and effective for learners of all ages and levels.",
    "size": 25,
    "reviews": 10,
    "ratingAvg": 4.8,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 12000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/b51rkDdG/Zoom.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 17,
    "description": "Zoom, developed by Zoom Video Communications, Inc., rose to prominence as the dominant platform for **video conferencing and team collaboration**, serving the needs of businesses, educational institutions, and individuals globally. It is prized for its high-quality video and audio transmission, low latency, and exceptional reliability, even under high traffic conditions. The app facilitates quick and easy initiation of video meetings, allowing participants to join seamlessly via a link or meeting ID from any device, including desktop, mobile, and dedicated conference room systems. Core features include **screen sharing** for presentations, **in-meeting chat**, virtual backgrounds, and **recording capabilities** for later review. Zoom supports large participant counts, making it ideal for webinars and large corporate events. The introduction of features like **Breakout Rooms** allows hosts to split participants into smaller groups for focused discussions. While a basic tier offers free meetings with time limits, paid subscriptions unlock extended meeting durations, advanced reporting, and cloud storage. Zoom remains the professional standard for virtual face-to-face communication, providing an essential digital tool for maintaining productivity and connection in a globally distributed workforce and education system.",
    "size": 90,
    "reviews": 12,
    "ratingAvg": 4.5,
    "downloads": 112,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 2800000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Hfh5WQhr/Google-meet-removebg-preview.png",
    "title": "Google Meet",
    "companyName": "Google LLC",
    "id": 18,
    "description": "Google Meet, developed by Google LLC, is a secure and highly reliable video conferencing service deeply integrated into the Google Workspace ecosystem, positioning it as a powerful communication tool for both enterprise and personal use. Designed for high-quality video meetings, it emphasizes ease of use, allowing users to join meetings instantly directly from a calendar invite, Gmail, or the app itself. The platform supports a substantial number of participants, making it suitable for large team meetings, virtual classrooms, and large-scale presentations. Key features include **live captions**, which provide real-time subtitles, and advanced noise cancellation to ensure clear audio quality. **Screen sharing** capabilities are robust, enabling seamless collaboration on documents and presentations. A major advantage of Google Meet is its **enterprise-grade security**, with meetings encrypted in transit and robust anti-abuse measures in place. Integration with other Google services, such as seamless inviting via Gmail contacts and direct creation from Google Calendar, enhances productivity. While free for individuals with time limits, Google Workspace subscriptions unlock features like longer meeting times, recording, and dial-in phone numbers, solidifying Google Meet's role as a vital, secure, and user-friendly platform for modern digital collaboration.",
    "size": 70,
    "reviews": 50,
    "ratingAvg": 4.4,
    "downloads": 108,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 73500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/VWRVZkr2/Chrome.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 19,
    "description": "Google Chrome, developed by Google LLC, is the world's most dominant web browser, celebrated for its speed, security, and seamless synchronization across devices. Its primary function is to provide an exceptionally fast browsing experience, powered by Google's V8 JavaScript engine. Chrome prioritizes user security with built-in features like **Safe Browsing**, which warns users before they navigate to dangerous websites, and frequent, automatic security updates. A key advantage is its **cross-device synchronization**, enabling users to effortlessly access their bookmarks, passwords, browsing history, and open tabs across their mobile phones, tablets, and desktop computers simply by logging into their Google account. The mobile app offers an intuitive interface with features such as voice search, data saver mode to reduce mobile data usage, and incognito mode for private browsing. Its extensibility is vast, with the Chrome Web Store offering thousands of extensions to customize and enhance functionality. Google Chrome's reliability, powerful security measures, and deep integration with Google's search and account services make it the default and preferred gateway to the internet for billions, defining the modern standard for fast, secure, and personalized web access.",
    "size": 60,
    "reviews": 200,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1200000 },
      { "name": "3 star", "count": 4500000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 165000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/JwxrpnNm/Drive.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 20,
    "description": "Google Drive, a robust cloud storage and file synchronization service from Google LLC, offers a secure and versatile platform for storing, sharing, and collaborating on documents, photos, and other files across all devices. It provides users with a generous amount of free storage, with options to purchase more, serving as a central hub for digital life and productivity. The app's primary strength is its **seamless integration with Google Docs, Sheets, and Slides**, allowing users to create and collaboratively edit documents in real-time directly within the platform. **File sharing and permission controls** are intuitive and precise, making it easy to share files with specific individuals or generate public links while maintaining control over editing rights. **Advanced search functionality** allows users to quickly locate files not only by name but also by content type and even text within images or PDFs. The mobile app ensures offline access to important files, allowing users to view and edit content even without an internet connection, with changes automatically syncing when online. Google Drive acts as an essential productivity and backup tool, safeguarding important data and enabling efficient, synchronized workflow for both individuals and large organizations.",
    "size": 50,
    "reviews": 150,
    "ratingAvg": 4.6,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 118000000 }
    ]
  }
]